#+OPTIONS: toc:t H:3
#+AUTHOR: Luis Xu
#+EMAIL: xuzhengchaojob@gmail.com
#+DATE: <2015-12-12 Thu 23:25>
#+TITLE: OrgMode 手册阅读笔记

[[http://orgmode.org/manual/][Org Manual]]的 阅读笔记, 及一些积累的使用技巧

#+BEGIN_VERSE
[BG]: We’ve got a lot more books coming out in the pipeline. The one which is my favourite is the Emacs Org-Mode Reference Manual. Honestly, it’s the greatest Emacs mode in 20 years. 

[CW]: Would you say Org-Mode is one of the more exciting projects in the Free Software world at the moment? 

[BG]: Definitely. Maybe it’s even the most exciting. Certainly it’s transformed the way that I organise my work, and I think it has for a lot of other people as well, so it’s software that can revolutionise your life, not just perform a function.

                                                                                                      -- Brian Gough vs Chris Woolfrey
#+END_VERSE

*** 时间计算.
  前面讲过表格支持时间计算.表格支持的时间格式为 HH:MM[:SS], 
  其中SS是可选, 如果公式后面接";T", 计算结果会展示为 HH:MM:SS.
  如果为";t", 计算结果为小时的小数表示. 下面的例子展示了这一点:
  #+BEGIN_SRC elisp
      |  Task 1 |   Task 2 |    Total |
      |---------+----------+----------|
      |    2:12 |     1:47 | 03:59:00 |
      | 3:02:20 | -2:07:00 |     0.92 |
      #+TBLFM: @2$3=$1+$2;T::@3$3=$1+$2;t
  #+END_SRC
*** 查找功能
 orgmode提供了三个查找函数用于在表中进行查找:
 + (org-lookup-first VAL S-LIST R-LIST &optional PREDICATE)
   在S-LIST中查找第一个 (PREDICATE VAL S)值为t的S. 并返回R-LIST与S位置相同的
   值. PREDICATE的默认值为 equal, 如果R-LIST为nil, 则返回S.
 + (org-lookup-first VAL S-LIST R-LIST &optional PREDICATE)
   与上一个函数意义相同, 不过是先查找最后一个.
 + (org-lookup-first VAL S-LIST R-LIST &optional PREDICATE)
   相似函数. 不过返回的是一个列表.

 下面是一个示例, 更多示例看这篇文章: http://orgmode.org/worg/org-tutorials/org-lookups.html
 #+BEGIN_SRC elisp
  #+TBLNAME: rates
 | currency        | abbreviation | euros |
 |-----------------+--------------+-------|
 | euro            | eur          |     1 |
 | Norwegian krone | nok          |  0.14 |
 | Swedish krona   | sek          |  0.12 |
 | US dollar       | usd          |  0.77 |

 #+TBLNAME: cost
 |  date | expense          |  sum | currency |   rate |  euros |   |
 |-------+------------------+------+----------+--------+--------+---|
 |  1.3. | flights          |  324 | eur      |      1 |    324 |   |
 |  4.6. | books and maps   |  243 | usd      |   0.77 | 187.11 |   |
 | 30.7. | rental car       | 8300 | sek      |   0.12 |   996. |   |
 |  2.7. | hotel            | 1150 | sek      |   0.12 |   138. |   |
 |  2.7. | lunch            |  190 | sek      |   0.12 |   22.8 |   |
 |  3.7. | fishing licenses | 1400 | nok      |   0.14 |   196. |   |
 |  3.7. | gasoline         |  340 |          | #ERROR | #ERROR |   |
  #+TBLFM: $5='(org-lookup-first $4 '(remote(rates,@2$2..@>$2)) '(remote(rates,@2$3..@>$3)))::$6=$5*$3
 函数解释第一个函数查找cost表的第四列和rates表的第二列相同的值, 并将查找结果对应的
 rates表的第三列填充到cost表的第五列, 然后计算第六列的值.
 #+END_SRC
*** 常用公式
  1. 使用Lisp代码需要前面加上' 
  2. 两列相加: $X = $M + $N. 或者 Lisp代码 '(+ $M $N);N'
     也可以
     需要说明的是: 如果第一行是表头, (即第二行是 ---- ), 第一行不会相加.
     例如下面的例子. 但是行相加会作用在第一行上.
     #+BEGIN_SRC elisp
     #+NAME: tbl1
  |  9 | 1 |  2 | 0 | 2 |
  |----+---+----+---+---|
  |  1 | 3 |  4 | 0 | 1 |
  | 10 | 3 | 13 | 0 | 3 |
  |  1 | 3 |  4 | 0 | 1 |
  |----+---+----+---+---|
  |  3 | 9 | 12 |   |   |
  #+TBLFM: $3=$1+$2
     #+END_SRC
  3. 多列相加: vsum($M..$N). 或者 '(apply '+ '($M..$N));N
  4. 时间计算, 时间格式必须为 HH:MM[:SS], 后面接 *T* 则结果会同样
     显示为时间, 接 *t* 则会表示为小数, 例如
     #+BEGIN_SRC elisp
  |         |        |      |          |
  |---------+--------+------+----------|
  |    1:00 |   2:23 | 3:33 | 06:56:00 |
  | 3:01:20 | 2:11:2 | -9:2 |    -3.83 |
  #+TBLFM: @2$4=$1+$2+$3;T::@3$4=$1+$2+$3;t
 
     #+END_SRC
